In [1]:
# pip install mysql-connector-python

In [2]:
import pandas as pd
import mysql.connector

In [11]:
connection = mysql.connector.connect(host="localhost", user="root", passwd="", database="user_demo")

In [14]:
df = pd.read_sql("select * from countries", connection)
df

   c_id      country        capital
0     1        India      New Delhi
1     2          USA  Washington DC
2     3       Canada         Ottawa
3     4     Thailand        Bangkok
4     5  South Korea          Seoul

In [13]:
pd.read_sql("select * from countries where country like '%a'", connection)

   c_id      country        capital
0     1        India      New Delhi
1     2          USA  Washington DC
2     3       Canada         Ottawa
3     5  South Korea          Seoul

In [15]:
df['country']

0          India
1            USA
2         Canada
3       Thailand
4    South Korea
Name: country, dtype: object

In [16]:
cursor = connection.cursor()

In [17]:
cursor.execute("insert into countries values(6, 'UAE', 'Abu Dhabi')")

In [18]:
connection.commit()